Repository: alexandrehtrb/Pororoca
Catalog: src/Pororoca.Desktop/Localization/strings.*.resx
Languages: it_it, pt_br, ru_ru, zh_cn

# RequestValidation/WebSocketUnknownClientMessageTranslationError
source: The message to send is invalid. Please, check it and try again.
it_it: Il messaggio da inviare non è valido. Controllalo e riprova.
pt_br: A mensagem a enviar é inválida. Por favor, verifique-a e tente novamente.
ru_ru: Отправляемое сообщение недействительно. Пожалуйста, проверьте это и повторите попытку.
zh_cn: 要发送的消息无效。请检查并再试一次。

# RequestValidation/WebSocketUnknownConnectionTranslationError
source: The connection request is invalid. Please, check it and try again.
it_it: La richiesta di connessione non è valida. Controllala e riprova.
pt_br: A requisição de conexão é inválida. Por favor, verifique-a e tente novamente.
ru_ru: Запрос на подключение недействителен. Пожалуйста, проверьте это и повторите попытку.
zh_cn: 连接请求无效。请检查并再试一次。

# TextEditor/Copy
source: Copy
it_it: Copia
pt_br: Copiar
ru_ru: Копировать
zh_cn: 复制

# TextEditor/Cut
source: Cut
it_it: Taglia
pt_br: Recortar
ru_ru: Вырезать
zh_cn: 剪切

# TextEditor/Paste
source: Paste
it_it: Incolla
pt_br: Colar
ru_ru: Вставить
zh_cn: 粘贴

# TopMenu/Contribute
source: Contribute
it_it: Contribuire
pt_br: Contribuir
ru_ru: Внести
zh_cn: 贡献

# TopMenu/File
source: File
pt_br: Arquivo
ru_ru: Файл
zh_cn: 文件

# TopMenu/Options
source: Options
it_it: Opzioni
pt_br: Opções
ru_ru: Настройки
zh_cn: 选项

# TopMenu/Help
source: Help
it_it: Aiuto
pt_br: Ajuda
ru_ru: Ажуда
zh_cn: 帮助

# TopMenu/Saved
source: Saved!
it_it: Salvato!
pt_br: Salvo!
ru_ru: Сохранено!
zh_cn: 保存!

# TopMenuFile/Exit
source: Exit
it_it: Esci
pt_br: Sair
ru_ru: Выход
zh_cn: 退出

# TopMenuFile/SaveAll
source: Save all
it_it: Salva tutto
pt_br: Salvar tudo
ru_ru: Сохранить все
zh_cn: 保存全部

# TopMenuFile/ImportFromFile
source: Import from file…
it_it: Importa da file…
pt_br: Importar de arquivo…
ru_ru: Импорт из файла…
zh_cn: 从文件导入...

# TopMenuFile/NewCollection
source: New collection
it_it: Nuova collezione
pt_br: Nova coleção
ru_ru: Новая коллекция
zh_cn: 新集合

# TopMenuLanguage/English
source: English
it_it: Inglese
pt_br: Inglês
ru_ru: Английский

# TopMenuLanguage/Português
source: Portuguese
it_it: Portoghese
pt_br: Português
ru_ru: Португальский

# TopMenuLanguage/Russian
source: Russian
it_it: Russo
pt_br: Russo
ru_ru: Русский

# TopMenuLanguage/Italian
source: Italian
it_it: Italiano
pt_br: Italiano
ru_ru: Итальяно

# TopMenuLanguage/SimplifiedChinese
source: Simplified Chinese
it_it: Cinese semplificato
pt_br: Chinês simplificado
ru_ru: Упрощенный китайский
zh_cn: 中文（简体）

# TopMenuOptions/EnableTlsVerification
source: Enable TLS verification
it_it: Abilita la verifica TLS
pt_br: Habilitar verificação de TLS
ru_ru: Включить TLS проверку
zh_cn: 启用 TLS 验证

# TopMenuOptions/Language
source: Language
it_it: Lingua
pt_br: Idioma
ru_ru: Язык
zh_cn: 语言

# TopMenuOptions/Theme
source: Theme
it_it: Tema
pt_br: Tema
ru_ru: Тема
zh_cn: 主题

# TopMenuTheme/AmazonianNight
source: Amazonian night
it_it: Notte amazzonica
pt_br: Noite amazônica

# TopMenuTheme/Dark
source: Dark
it_it: Scuro
pt_br: Escuro
ru_ru: Темная

# TopMenuTheme/Light
source: Light
it_it: Chiaro
pt_br: Claro
ru_ru: Светлая

# TopMenuHelp/ViewKeyboardShortcuts
source: View keyboard shortcuts
it_it: Visualizza scorciatoie da tastiera
pt_br: Ver atalhos do teclado
ru_ru: Просмотр сочетаний клавиш
zh_cn: 查看键盘快捷键

# TopMenuHelp/OpenDocsWebsite
source: Go to docs
it_it: Vai alla documentazione
pt_br: Ir à documentação
ru_ru: Перейти к докс
zh_cn: 转到文档

# TopMenuHelp/RunUITests
source: Run UI tests (Ctrl+F12)
it_it: Esegui test UI (Ctrl+F12)
pt_br: Rodar testes de UI (Ctrl+F12)
ru_ru: Выполнение UI тестов (Ctrl+F12)
zh_cn: 运行UI测试 (Alt +F12)

# UpdateReminder/DialogCancel
source: I'll check later
it_it: Controllerò più tardi
pt_br: Verifico depois
ru_ru: Проверю позже
zh_cn: 我稍后再检查

# UpdateReminder/DialogGoToSite
source: Go to site
it_it: Vai al sito
pt_br: Ir ao site
ru_ru: Перейти на сайт
zh_cn: 前往网站

# UpdateReminder/DialogMessage
source: Remember to periodically check for updates!
it_it: Ricorda di controllare periodicamente gli aggiornamenti!
pt_br: Lembre-se de verificar periodicamente por novas atualizações!
ru_ru: Не забывайте периодически проверять наличие обновлений!
zh_cn: 新版本可用！\\n\\n{0}\\n\\n 您想访问下载页面吗？

# WebSocketClientMessage/ContentFileSearchFile
source: Search file…
it_it: Cerca file…
pt_br: Procurar arquivo…
ru_ru: Поиск файла…
zh_cn: 搜索文件...

# WebSocketClientMessage/ContentFileSrcPathWatermark
source: (file path here)
it_it: (qui il percorso del file)
pt_br: (caminho do arquivo aqui)
ru_ru: (путь к файлу)
zh_cn: (文件路径)

# WebSocketClientMessage/ContentModeFile
source: File
pt_br: Arquivo
ru_ru: Файл
zh_cn: 文件

# WebSocketClientMessage/ContentModeRaw
source: Raw
it_it: Grezzo
pt_br: Digitado
zh_cn: 原始

# WebSocketClientMessage/ContentRawWatermark
source: (raw content here)
it_it: (qui il contenuto grezzo)
pt_br: (digite o conteúdo aqui)
ru_ru: (raw контент)
zh_cn: (原始内容)

# WebSocketClientMessage/DisableCompressionExplanation
source: Be careful when using compression with encrypted data - look out for CRIME / BREACH attacks.
it_it: Fai attenzione quando usi la compressione con dati crittografati - attento agli attacchi CRIME / BREACH.
pt_br: Cuidado ao usar compressão junto com dados criptografados - leia sobre ataques CRIME / BREACH.
ru_ru: Будьте осторожны при использовании сжатия с зашифрованными данными - следите за преступлениями / взломами.
zh_cn: 对加密数据使用压缩时要小心 - 留意犯罪/泄露攻击。

# WebSocketClientMessage/DisableCompressionForThisMessage
source: Disable compression for this message
it_it: Disabilita la compressione per questo messaggio
pt_br: Desabilitar compressão para esta mensagem
ru_ru: Отключить сжатие для этого сообщения
zh_cn: 禁用此消息的压缩

# WebSocketClientMessage/MessageTypeBinary
source: Binary
it_it: Binario
pt_br: Binário
ru_ru: Двоичный
zh_cn: 二进制

# WebSocketClientMessage/MessageTypeClose
source: Closing message
it_it: Messaggio di chiusura
pt_br: Encerramento de conexão
ru_ru: Сообщение о закрытии
zh_cn: 结束消息

# WebSocketClientMessage/MessageTypeText
source: Text
it_it: Testo
pt_br: Texto
ru_ru: Текст
zh_cn: 文本

# WebSocketClientMessage/NewMessage
source: New client message
it_it: Nuovo messaggio del client
pt_br: Nova mensagem de cliente
ru_ru: Новое клиентское сообщение
zh_cn: 新建客户端消息

# WebSocketClientMessage/RawContentOtherSyntax
source: Other
it_it: Altro
pt_br: Outra
ru_ru: Другой
zh_cn: 其他

# WebSocketConnection/CancelConnect
source: Cancel
it_it: Annulla
pt_br: Cancelar
ru_ru: Отмена
zh_cn: 取消

# WebSocketConnection/CancelConnectToolTip
source: Cancel (F6)
it_it: Annulla (F6)
pt_br: Cancelar (F6)
ru_ru: Отмена (F6)
zh_cn: 取消 (F6)

# WebSocketConnection/CancelDisconnect
source: Cancel
it_it: Annulla
pt_br: Cancelar
ru_ru: Отмена
zh_cn: 取消

# WebSocketConnection/CompressionClientContextTakeover
source: Client context takeover
pt_br: Retomada de contexto pelo cliente
ru_ru: Захват клиентского контекста
zh_cn: 客户端上下文接管

# WebSocketConnection/CompressionClientMaxWindowBits
source: Client max window bits
pt_br: Máx. bits janela do cliente
ru_ru: Максимальное количество битов окна клиента
zh_cn: 客户端最大窗口位数

# WebSocketConnection/CompressionServerContextTakeover
source: Server context takeover
pt_br: Retomada de contexto pelo servidor
ru_ru: Захват контекста сервера
zh_cn: 服务器上下文接管

# WebSocketConnection/CompressionServerMaxWindowBits
source: Server max window bits
pt_br: Máx. bits janela do servidor
ru_ru: Максимальное количество битов окна сервера
zh_cn: 服务器最大窗口位数

# WebSocketConnection/Connect
source: Connect
it_it: Connetti
pt_br: Conectar
ru_ru: Соединить
zh_cn: 连接

# WebSocketConnection/ConnectToolTip
source: Connect (F5)
it_it: Connetti (F5)
pt_br: Conectar (F5)
ru_ru: Соединить (F5)
zh_cn: 连接 (F5)

# WebSocketConnection/Connected
source: CONNECTED
it_it: CONNESSO
pt_br: CONECTADO
ru_ru: СОЕДИНЕН

# WebSocketConnection/ConnectionResponse
source: Response
it_it: Risposta
pt_br: Resposta
ru_ru: Ответ
zh_cn: 响应

# WebSocketConnection/ConnectionExceptionWatermark
source: (connection exception here, if it happens)
it_it: (Eccezione di connessione qui se si verifica)
pt_br: (erro de conexão aqui, se ocorrer)
ru_ru: (исключение подключения здесь, если это произойдет)
zh_cn: (如果发生连接异常，请参阅此处)

# WebSocketConnection/ConnectionRequestHeaderAdd
source: Add header
it_it: Aggiungi intestazione
pt_br: Adicionar cabeçalho
ru_ru: Добавить header
zh_cn: 添加报头

# WebSocketConnection/ConnectionRequestOptions
source: Options
it_it: Opzioni
pt_br: Opções
ru_ru: Настройки
zh_cn: 选项

# WebSocketConnection/ConnectionRequestSubprotocolAdd
source: Add subprotocol
it_it: Aggiungi sottoprotocollo
pt_br: Adicionar subprotocolo
ru_ru: Добавить подпротокол
zh_cn: 添加子协议

# WebSocketConnection/ConnectionRequestSubprotocolEnabled
source: ENABLED
it_it: ABILITATO
pt_br: HABILITADO
ru_ru: ВКЛЮЧЕН

# WebSocketConnection/ConnectionRequestSubprotocolName
source: NAME
it_it: NOME
pt_br: NOME
ru_ru: ИМЯ

# WebSocketConnection/Disconnect
source: Disconnect
it_it: Disconnetti
pt_br: Desconectar
ru_ru: Разъединить
zh_cn: 断开连接

# WebSocketConnection/DisconnectToolTip
source: Disconnect (F6)
it_it: Disconnetti (F6)
pt_br: Desconectar (F6)
ru_ru: Разъединить (F6)
zh_cn: 断开连接 (F6)

# WebSocketConnection/EnableCompression
source: Enable compression
it_it: Abilita compressione
pt_br: Habilitar compressão
ru_ru: Включить сжатие
zh_cn: 启用压缩

# WebSocketConnection/NewConnection
source: New WebSocket connection
it_it: Nuova connessione WebSocket
pt_br: Nova conexão WebSocket
ru_ru: Новое WebSocket соединение
zh_cn: 新建 WebSocket 连接

# WebSocketConnection/OptionCompression
source: Compression
it_it: Compressione
pt_br: Compressão
ru_ru: Сжатие
zh_cn: 压缩

# WebSocketConnection/OptionHeaders
source: Headers
it_it: Intestazioni
pt_br: Cabeçalhos
zh_cn: 报头

# WebSocketConnection/OptionSubprotocols
source: Subprotocols
it_it: Sottoprotocolli
pt_br: Subprotocolos
ru_ru: Подпротоколы
zh_cn: 子协议

# WebSocketConnection/SectionTitle
source: Connection
it_it: Connessione
pt_br: Conexão
ru_ru: Соединить
zh_cn: 连接

# WebSocketConnection/UrlWatermark
source: (websocket url here)
it_it: (url websocket qui)
pt_br: (url do websocket aqui)
ru_ru: (websocket url)
zh_cn: (websocket url)

# WebSocketExchangedMessageDetail/ContentWatermark
source: (message content)
it_it: (Contenuto del messaggio)
pt_br: (conteúdo da mensagem)
ru_ru: (контент сообщения)
zh_cn: (消息内容)

# WebSocketExchangedMessageDetail/MessageTypeWatermark
source: (message type)
it_it: (Tipo di messaggio)
pt_br: (tipo da mensagem)
ru_ru: (тип сообщения)
zh_cn: (消息类型)

# WebSocketExchangedMessageDetail/SaveToFile
source: Save as…
it_it: Salva con nome…
pt_br: Salvar como…
ru_ru: Сохранить как…
zh_cn: 另存为...

# WebSocketExchangedMessageDetail/SaveToFileToolTip
source: Save as… (F9)
it_it: Salva con nome… (F9)
pt_br: Salvar como… (F9)
ru_ru: Сохранить как… (F9)
zh_cn: 另存为... (F9)

# WebSocketExchangedMessageDetail/SectionTitle
source: Message detail
it_it: Dettagli del messaggio
pt_br: Detalhe da mensagem
ru_ru: Детали сообщения
zh_cn: 消息细节

# WebSocketExchangedMessages/BinaryContentDescriptionFormat
source: binary, {0} bytes
it_it: binario, {0} byte
pt_br: binário, {0} bytes
ru_ru: двоичный, {0} байтов
zh_cn: 二进制，{0} 字节

# WebSocketExchangedMessages/ClosingMessageContentDescriptionFormat
source: closing, {0} bytes
it_it: chiusura, {0} byte
pt_br: encerramento, {0} bytes
ru_ru: закрывающие, {0} байтов
zh_cn: 关闭，{0} 字节

# WebSocketExchangedMessages/FromClientToServer
source: client -> server
pt_br: cliente -> servidor
ru_ru: клиент -> сервер
zh_cn: 客户端 -> 服务器

# WebSocketExchangedMessages/FromServerToClient
source: server -> client
pt_br: servidor -> cliente
ru_ru: сервер -> клиент
zh_cn: 服务器 -> 客户端

# WebSocketExchangedMessages/SectionTitle
source: Messages exchanged
it_it: Messaggi scambiati
pt_br: Mensagens trocadas
ru_ru: Обмен сообщениями
zh_cn: 交换消息

# WebSocketExchangedMessages/SendMessage
source: Send
it_it: Invia
pt_br: Enviar
ru_ru: Отправить
zh_cn: 发送

# WebSocketExchangedMessages/TextContentDescriptionFormat
source: text, {0} bytes
it_it: testo, {0} byte
pt_br: texto, {0} bytes
ru_ru: текст, {0} байтов
zh_cn: 文本，{0} 字节

# HttpRequest/BodyModeUrlEncoded
source: URL encoded
ru_ru: закодированный URL
zh_cn: URL 编码

# TimeText/MillisecondsFormat
source: {0}ms
ru_ru: {0}мс

# TimeText/HoursAndMinutesFormat
source: {0}h {1]min
ru_ru: {0}ч {1]мин

# TimeText/MinutesAndSecondsFormat
source: {0}min {1}s
ru_ru: {0}мин {1}с

# TimeText/MinutesFormat
source: {0}min
ru_ru: {0}мин

# TimeText/SecondsFormat
source: {0:0.00}s
ru_ru: {0:0.00}с

# RequestAuth/AuthModeBasicLoginWatermark
source: (basic auth login)
ru_ru: (basic auth логин)
zh_cn: (基本授权登录)

# RequestAuth/AuthModeBearerTokenWatermark
source: (bearer auth token)
ru_ru: (bearer auth токен)
zh_cn: (承载身份验证令牌)

# WebSocketConnection/CustomAuth
source: Auth
it_it: Autenticazione
zh_cn: 授权

# HttpRequest/BodyModeFormData
source: Form Data
zh_cn: 表单数据

# RequestAuth/AuthModeBasic
source: Basic
zh_cn: 基本

# RequestAuth/AuthModeBearer
source: Bearer
zh_cn: 承载

# RequestAuth/AuthModeWindowsLoginWatermark
source: (login)
zh_cn: (登录)

# RequestAuth/AuthModeWindowsPasswordWatermark
source: (password)
zh_cn: (密码)
