Repository: alexandrehtrb/Pororoca
Catalog: src/Pororoca.Desktop/Localization/strings.*.resx
Languages: it_it, pt_br, ru_ru, zh_cn

# GoBack/Hint
source: Go back
it_it: Indietro
pt_br: Voltar
ru_ru: Вернуться
zh_cn: 返回

# MacOSXUserDataFolderMigratedV3Dialog/Title
source: Pororoca - User data folder migrated
it_it: Pororoca - Cartella dei dati utente migrata
pt_br: Pororoca - Pasta de dados migrada
ru_ru: Pororoca - Перенесенная папка с пользовательскими данными
zh_cn: Pororoca - 用户数据文件夹已迁移

# MacOSXUserDataFolderMigratedV3Dialog/Message
source: Your user data directory is now located at:\\n{0}\\nYou can backup and manually delete the PororocaUserData folder inside Applications.
it_it: La cartella dei dati utente si trova ora in:\\n{0}\\nÈ possibile eseguire un backup ed eliminare manualmente la cartella PororocaUserData all'interno di Applicazioni.
pt_br: Seu diretório de dados de usuário agora é:\\n{0}\\nVocê pode fazer um backup e excluir manualmente a pasta PororocaUserData dentro de Aplicações.
ru_ru: Каталог пользовательских данных теперь находится по адресу:\\n{0}\\nВы можете сделать резервную копию и вручную удалить папку PororocaUserData в Приложениях.
zh_cn: 您的用户数据目录现在位于：\\n{0}\\n您可以备份和手动删除应用程序内的PororocaUserData文件夹。

# Welcome/Title
source: Welcome!
it_it: Benvenuto(a)!
pt_br: Bem-vindo(a)!
ru_ru: Добро пожаловать!
zh_cn: 欢迎!

# Welcome/NewCollection
source: New collection
it_it: Nuova collezione
pt_br: Nova coleção
ru_ru: Новая коллекция
zh_cn: 新集合

# Welcome/ImportCollection
source: Import collection…
it_it: Importa collezione…
pt_br: Importar coleção…
ru_ru: Импорт коллекции…
zh_cn: 导入集合...

# Welcome/ImportOpenAPI
source: Import OpenAPI…
it_it: Importa OpenAPI…
pt_br: Importar OpenAPI…
ru_ru: Импорт OpenAPI…
zh_cn: 导入 OpenAPI…

# Welcome/OpenDocsWebsite
source: Go to docs
it_it: Vai alla documentazione
pt_br: Ir à documentação
ru_ru: Перейти к докс
zh_cn: 转到文档

# Welcome/VisitGitHubRepo
source: Visit GitHub repo
it_it: Visita il GitHub repo
pt_br: Visitar GitHub
ru_ru: Перейти на GitHub
zh_cn: 访问 GitHub 仓库

# CannotCopyOrCutCollectionDialog/Title
source: Pororoca - Copy items
it_it: Pororoca - Copia elementi
pt_br: Pororoca - Copiar itens
ru_ru: Pororoca - Копировать элементы
zh_cn: Pororoca - 复制项目

# CannotCopyOrCutCollectionDialog/Content
source: You can duplicate, but not copy or cut a collection.
it_it: Puoi duplicare, ma non copiare o tagliare una collezione.
pt_br: Você pode duplicar, mas não copiar ou recortar uma coleção.
ru_ru: Вы можете дублировать, но не копировать или вырезать коллекцию.
zh_cn: 您可以复制，但不能复制或剪切集合。

# CannotPasteItemToItselfDialog/Title
source: Pororoca - Cut items
it_it: Pororoca - Taglia elementi
pt_br: Pororoca - Recortar itens
ru_ru: Pororoca - Вырезать предметы
zh_cn: Pororoca - 剪切项目

# CannotPasteItemToItselfDialog/Content
source: Cannot paste a cut item to itself.
it_it: Non è possibile incollare un elemento tagliato su se stesso.
pt_br: Não é possível colar um item recortado a si mesmo.
ru_ru: Невозможно вставить вырезанный элемент сам в себя.
zh_cn: 无法将剪切项目粘贴到其本身。

# Collection/AddEnvironment
source: Add environment
it_it: Aggiungi ambiente
pt_br: Adicionar ambiente
ru_ru: Добавить окружение
zh_cn: 添加环境

# Collection/AddFolder
source: Add folder
it_it: Aggiungi cartella
pt_br: Adicionar pasta
ru_ru: Добавить папку
zh_cn: 添加文件夹

# Collection/AddHttpRequest
source: Add HTTP request
it_it: Aggiungi richiesta HTTP
pt_br: Adicionar req. HTTP
ru_ru: Добавить HTTP запрос
zh_cn: 添加 HTTP 请求

# Collection/AddHttpRepeater
source: Add HTTP repeater
it_it: Aggiungi ripetitore
pt_br: Adicionar repetidora
ru_ru: Добавить ретранслятор
zh_cn: 添加 HTTP 转发器

# Collection/SetCollectionScopedHeaders
source: Set collection headers
it_it: Intestazioni di collezione
pt_br: Cabeçalhos de coleção
ru_ru: Заголовки коллекций
zh_cn: 设置集合标题

# Collection/AddWebSocketConnection
source: Add WebSocket
it_it: Aggiungi WebSocket
pt_br: Adicionar WebSocket
ru_ru: Добавить WebSocket
zh_cn: 添加 WebSocket

# Collection/ChooseImportExportFormat
source: Choose format
it_it: Scegli formato
pt_br: Selecione o formato
ru_ru: Выбрать формат
zh_cn: 选择格式

# Collection/ExportCollection
source: Export collection…
it_it: Esporta collezione…
pt_br: Exportar coleção…
ru_ru: Экспорт колекции…
zh_cn: 导出集合…

# Collection/ImportCollectionDialogTitle
source: Import collection / OpenAPI files
it_it: Importa file di collezione / OpenAPI
pt_br: Importar arquivos de coleção / OpenAPI
ru_ru: Импорт файлов коллекции / OpenAPI
zh_cn: 导入集合 / OpenAPI 文件

# Collection/ImportCollectionDialogTypes
source: Collection / OpenAPI files
it_it: File di collezione / OpenAPI
pt_br: Arquivos de coleção / OpenAPI
ru_ru: Файлы коллекции / OpenAPI
zh_cn: 集合 / OpenAPI 文件

# Collection/FailedToImportCollectionDialogTitle
source: Pororoca - Import collection / OpenAPI
it_it: Pororoca - Importa collezione / OpenAPI
pt_br: Pororoca - Importar coleção / OpenAPI
ru_ru: Pororoca - Файлы коллекции / OpenAPI
zh_cn: Pororoca - 导入集合 / OpenAPI 文件

# Collection/FailedToImportCollectionDialogMessage
source: Failed to import collection / OpenAPI file.\\n\\nAccepted types:\\n\\n- Pororoca collection\\n- Postman collection v2.1\\n- OpenAPI (Swagger), in JSON or YAML\\n- Insomnia collection
it_it: Impossibile importare il file di collezione / OpenAPI.\\n\\nTipi accettati:\\n\\n- Pororoca collection\\n- Postman collection v2.1\\n- OpenAPI (Swagger), in JSON o YAML\\n- Insomnia collection
pt_br: Não foi possível importar o arquivo de coleção / OpenAPI.\\n\\nTipos aceitos:\\n\\n- Coleção Pororoca\\n- Postman collection v2.1\\n- OpenAPI (Swagger), em JSON ou YAML\\n- Insomnia collection
ru_ru: Не удалось импортировать коллекцию / файл OpenAPI.\\n\\nДопустимые типы:\\n\\n- Pororoca collection\\n- Postman collection v2.1\\n- OpenAPI (Swagger), в JSON или YAML\\n- Insomnia collection
zh_cn: 无法导入集合/OpenAPI 文件。\\n\\n接受的类型：\\n\\n- Pororoca collection\\n- Postman collection v2.1\\n- OpenAPI (Swagger), 在 JSON 或 YAML 中\\n- Insomnia collection

# Collection/ImportEnvironment
source: Import environment…
it_it: Importa ambiente…
pt_br: Importar ambiente…
ru_ru: Импорт окружения…
zh_cn: 导入环境...

# Collection/ImportEnvironmentDialogTitle
source: Import environment files
it_it: Importa file di ambiente
pt_br: Importar arquivos de ambiente
ru_ru: Импорт файлов окружения
zh_cn: 导入环境文件

# Collection/ImportEnvironmentDialogTypes
source: Environment files
it_it: File di ambiente
pt_br: Arquivos de ambiente
ru_ru: файлы окружения
zh_cn: 环境文件

# Collection/FailedToImportEnvironmentDialogTitle
source: Pororoca - Import environment
it_it: Pororoca - Importa environment
pt_br: Pororoca - Importar ambiente
ru_ru: Pororoca - Импорт окружения
zh_cn: Pororoca - 导入环境文件

# Collection/FailedToImportEnvironmentDialogMessage
source: Failed to import environment file.\\n\\nAccepted types:\\n\\n- Pororoca environment\\n- Postman environment
it_it: Impossibile importare il file di ambiente.\\n\\nTipi accettati:\\n\\n- Ambiente Pororoca\\n- Ambiente Postman
pt_br: Não foi possível importar o arquivo de ambiente.\\n\\nTipos aceitos:\\n\\n- Ambiente Pororoca\\n- Postman environment
ru_ru: Не удалось импортировать файл среды.\\n\\nДопустимые типы:\\n\\n- Pororoca environment\\n- Postman environment
zh_cn: 导入环境文件失败。\\n\\n接受的类型：\\n\\n- Pororoca environment\\n- Postman environment

# Collection/NewCollection
source: New collection
it_it: Nuova collezione
pt_br: Nova coleção
ru_ru: Новая коллекция
zh_cn: 新集合

# CollectionFolder/AddFolder
source: Add folder
it_it: Aggiungi cartella
pt_br: Adicionar pasta
ru_ru: Добавить папку
zh_cn: 添加文件夹

# CollectionFolder/AddHttpRequest
source: Add HTTP request
it_it: Aggiungi richiesta HTTP
pt_br: Adicionar req. HTTP
ru_ru: Добавить HTTP запрос
zh_cn: 添加 HTTP 请求

# CollectionFolder/AddWebSocketConnection
source: Add WebSocket
it_it: Aggiungi WebSocket
pt_br: Adicionar WebSocket
ru_ru: Добавить WebSocket
zh_cn: 添加 WebSocket

# CollectionFolder/AddHttpRepeater
source: Add HTTP repeater
it_it: Aggiungi ripetitore
pt_br: Adicionar repetidora
ru_ru: Добавить ретранслятор
zh_cn: 添加 HTTP 转发器

# CollectionScopedAuth/Title
source: Collection-scoped auth
it_it: Autenticazione a livello di collezione
pt_br: Autenticação a nível de coleção
ru_ru: Авторизация на уровне коллекции
zh_cn: Collection-scoped 授权

# CollectionScopedRequestHeaders/Title
source: Collection-scoped request headers
it_it: Intestazioni a livello di collezione
pt_br: Cabeçalhos a nível de coleção
ru_ru: Заголовки на уровне коллекции
zh_cn: Collection-scoped 请求标头

# CollectionVariables/AddVariable
source: Add variable
it_it: Aggiungi variabile
pt_br: Adicionar variável
ru_ru: Добавить переменную
zh_cn: 添加变量

# CollectionVariables/RemoveVariable
source: Remove variable
it_it: Rimuovi variabile
pt_br: Remover variável
ru_ru: Удалить переменную
zh_cn: 移除变量

# CollectionVariables/Tip
source: Tip: To use a variable, type {{VariableName}} in the URL, body, authentication or header of your request. When sending the request, the {{VariableName}} text will be replaced by the variable's value.
it_it: Suggerimento: Per utilizzare una variabile, digita {{NomeVariabile}} nell'URL, nel corpo, nell'autenticazione o nell'intestazione della tua richiesta. Quando invii la richiesta, il testo {{NomeVariabile}} verrà sostituito dal valore della variabile.
pt_br: Dica: Para usar uma variável, digite o {{NomeDaVariável}} na URL, no corpo, autenticação ou cabeçalho da sua requisição. Ao enviar a chamada, o texto {{NomeDaVariável}} será substituído pelo valor da variável.
ru_ru: Совет: Чтобы использовать переменную, введите {{VariableName}} в URL, теле, аутентификации или заголовке вашего запроса. При отправке запроса текст {{VariableName}} будет заменен значением переменной.
zh_cn: 提示：要使用变量，请在请求的 URL、正文、身份验证或标头中输入 {{VariableName}}。发送请求时，{{VariableName}} 文本将被变量的值替换。

# CollectionVariables/Title
source: Collection variables
it_it: Variabili della collezione
pt_br: Variáveis da coleção
ru_ru: Переменные коллекции
zh_cn: 集合变量

# Variables/Enabled
source: ENABLED
it_it: ABILITATO
pt_br: HABILITADA
ru_ru: ВКЛЮЧЕН

# Variables/IsSecret
source: IS SECRET
it_it: È SEGRETO
pt_br: SECRETA
ru_ru: СЕКРЕТ

# Variables/Name
source: VARIABLE NAME
it_it: NOME VARIABILE
pt_br: NOME DA VARIÁVEL
ru_ru: ИМЯ ПЕРЕМЕННОЙ

# Variables/Value
source: VALUE
it_it: VALORE
pt_br: VALOR
ru_ru: ЗНАЧЕНИЕ

# CollectionsGroup/CollectionScopedAuth
source: Auth
it_it: Autenticazione
pt_br: Autenticação
zh_cn: 授权

# CollectionsGroup/Environments
source: Environments
it_it: Ambienti
pt_br: Ambientes
ru_ru: Окружения
zh_cn: 环境

# CollectionsGroup/Variables
source: Variables
it_it: Variabili
pt_br: Variáveis
ru_ru: Переменные
zh_cn: 变量

# ContextMenu/Copy
source: Copy
it_it: Copia
pt_br: Copiar
ru_ru: Копировать
zh_cn: 复制

# ContextMenu/Cut
source: Cut
it_it: Taglia
pt_br: Recortar
ru_ru: Резать
zh_cn: 剪切

# ContextMenu/Delete
source: Delete
it_it: Elimina
pt_br: Excluir
ru_ru: Удалить
zh_cn: 删除

# ContextMenu/Duplicate
source: Duplicate
it_it: Duplica
pt_br: Duplicar
ru_ru: Дублировать
zh_cn: 重复

# ContextMenu/Export
source: Export
it_it: Esporta
pt_br: Exportar
ru_ru: Экспорт
zh_cn: 导出

# ContextMenu/ImportEnvironment
source: Import environment…
it_it: Importa ambiente…
pt_br: Importar ambiente…
ru_ru: Импорт окружения…
zh_cn: 导入环境...

# ContextMenu/MoveDown
source: Move down
it_it: Sposta in basso
pt_br: Mover para baixo
ru_ru: Вниз
zh_cn: 下移

# ContextMenu/MoveUp
source: Move up
it_it: Sposta in alto
pt_br: Mover para cima
ru_ru: Вверх
zh_cn: 上移

# ContextMenu/NewEnvironment
source: New environment
it_it: Nuovo ambiente
pt_br: Novo ambiente
ru_ru: Новое окружение
zh_cn: 新建环境

# ContextMenu/NewFolder
source: New folder
it_it: Nuova cartella
pt_br: Nova pasta
ru_ru: Новая папка
zh_cn: 新建文件夹

# ContextMenu/NewHttpRequest
source: New HTTP request
it_it: Nuova richiesta HTTP
pt_br: Nova requisição HTTP
ru_ru: Новый HTTP запрос
zh_cn: 新建 HTTP 请求

# ContextMenu/NewHttpRepeater
source: New HTTP repeater
it_it: Nuovo ripetitore
pt_br: Nova repetidora
ru_ru: Новый ретранслятор
zh_cn: 新建 HTTP 转发器

# ContextMenu/NewWebSocketClientMessage
source: New client message
it_it: Nuovo messaggio del client
pt_br: Nova mensagem de cliente
ru_ru: Новое клиентское сообщение
zh_cn: 新建客户端消息

# ContextMenu/NewWebSocketConnection
source: New WebSocket
it_it: Nuovo WebSocket
pt_br: Novo WebSocket
ru_ru: Новый WebSocket
zh_cn: 新建 WebSocket

# ContextMenu/Paste
source: Paste
it_it: Incolla
pt_br: Colar
ru_ru: Вставить
zh_cn: 粘贴

# ContextMenu/Rename
source: Rename
it_it: Rinomina
pt_br: Renomear
ru_ru: Переименовать
zh_cn: 重命名

# ContextMenu/SetAsCurrentEnvironment
source: Set as current environment
it_it: Imposta come ambiente corrente
pt_br: Definir como ambiente atual
ru_ru: Установлено в качестве текущей среды
zh_cn: 设置为当前环境

# DeleteItemsDialog/Title
source: Pororoca - Delete items
it_it: Pororoca - Elimina elementi
pt_br: Pororoca - Excluir itens
ru_ru: Pororoca - Удаление элементов
zh_cn: Pororoca - 删除项目

# DeleteItemsDialog/MessageSingleItem
source: Are you sure you want to delete '{0}'?
it_it: Sei sicuro di voler eliminare '{0}'?
pt_br: Tem certeza de que quer excluir '{0}'?
ru_ru: Вы действительно хотите удалить '{0}'?
zh_cn: 您确定要删除 '{0}' 吗？

# DeleteItemsDialog/MessageMultipleItems
source: Are you sure you want to delete the selected items?
it_it: Sei sicuro di voler eliminare gli elementi selezionati?
pt_br: Tem certeza de que quer excluir os itens selecionados?
ru_ru: Вы действительно хотите удалить выбранные элементы?
zh_cn: 您确定要删除所选项目吗？

# EditableTextBlock/RenameToolTip
source: Rename (F2)
it_it: Rinomina (F2)
pt_br: Renomear (F2)
ru_ru: Переименовать (F2)
zh_cn: 重命名 (F2)

# Environment/AddVariable
source: Add variable
it_it: Aggiungi variabile
pt_br: Adicionar variável
ru_ru: Добавить переменную
zh_cn: 添加变量

# Environment/ExportEnvironment
source: Export environment…
it_it: Esporta ambiente…
pt_br: Exportar ambiente…
ru_ru: Экспорт окружения…
zh_cn: 导出环境…

# Environment/NewEnvironment
source: New environment
it_it: Nuovo ambiente
pt_br: Novo ambiente
ru_ru: Новое окружение
zh_cn: 新建环境

# Environment/RemoveVariable
source: Remove variable
it_it: Rimuovi variabile
pt_br: Remover variável
ru_ru: Удалить переменную
zh_cn: 移除变量

# Environment/SetAsCurrentEnvironment
source: Set as current environment
it_it: Imposta come ambiente corrente
pt_br: Definir como ambiente atual
ru_ru: Включить как текущую среду
zh_cn: 设置为当前环境

# Environment/UnsetAsCurrentEnvironment
source: Disable as current environment
it_it: Disabilita come ambiente corrente
pt_br: Desativar como ambiente atual
ru_ru: Отключить как текущую среду
zh_cn: 禁用当前环境

# Environment/Tip
source: Tip: If an environment variable has the same name of an other collection variable, the value of the environment variable will be the one applied.
it_it: Suggerimento: Se una variabile di ambiente ha lo stesso nome di un'altra variabile di collezione, il valore della variabile di ambiente sarà quello applicato.
pt_br: Dica: Se uma variável de ambiente tiver o mesmo nome que uma variável de coleção, o valor da variável de ambiente é o que será usado.
ru_ru: Совет: Если переменная окружения имеет то же имя, что и другая переменная коллекции, то будет применено значение переменной окружения.
zh_cn: 提示：如果环境变量与其他集合变量同名，则环境变量的值将是应用的值。

# ExportCollection/Title
source: Export collection…
it_it: Esporta collezione…
pt_br: Exportar coleção…
ru_ru: Экспорт колекции…
zh_cn: 导出集合…

# ExportCollection/Export
source: Export
it_it: Esporta
pt_br: Exportar
ru_ru: Экспорт
zh_cn: 导出集合

# ExportCollection/Format
source: Format:
it_it: Formato:
pt_br: Formato:
ru_ru: Формат:
zh_cn: 格式:

# ExportCollection/DialogTitle
source: Export collection to file
it_it: Esporta collezione su file
pt_br: Exportar coleção para arquivo
ru_ru: Экспорт колекции в файл
zh_cn: 将集合输出到文件

# ExportCollection/IncludeCollectionVariablesSecrets
source: Include collection secret variables
it_it: Includi variabili segrete della collezione
pt_br: Incluir variáveis secretas da coleção
ru_ru: Включение секретных переменных коллекции
zh_cn: 包括集合的机密变量

# ExportCollection/PororocaCollectionFormat
source: Pororoca collection
it_it: Collezione Pororoca
pt_br: Coleção do Pororoca
ru_ru: Pororoca коллекция
zh_cn: Pororoca 集合

# ExportCollection/PostmanCollectionFormat
source: Postman collection v2.1
it_it: Collezione Postman v2.1
pt_br: Coleção v2.1 do Postman
ru_ru: Postman коллекция v2.1
zh_cn: Postman 集合 v2.1

# ExportCollection/EnvironmentInclude
source: INCLUDE
it_it: INCLUDI
pt_br: INCLUIR
ru_ru: ВКЛЮЧАТЬ
zh_cn: 包括

# ExportCollection/EnvironmentName
source: ENVIRONMENT
it_it: AMBIENTE
pt_br: AMBIENTE
ru_ru: ОКРУЖЕНИЯ
zh_cn: 环境

# ExportCollection/EnvironmentWithSecretVariables
source: WITH SECRETS
it_it: CON SEGRETI
pt_br: COM SEGREDOS
ru_ru: С СЕКРЕТАМИ
zh_cn: 有秘密

# ExportEnvironment/Title
source: Export environment…
it_it: Esporta ambiente…
pt_br: Exportar ambiente…
ru_ru: Экспорт окружения…
zh_cn: 导出环境…

# ExportEnvironment/Export
source: Export
it_it: Esporta
pt_br: Exportar
ru_ru: Экспорт
zh_cn: 导出集合

# ExportEnvironment/Format
source: Format:
it_it: Formato:
pt_br: Formato:
ru_ru: Формат:
zh_cn: 格式:

# ExportEnvironment/DialogTitle
source: Export environment to file
it_it: Esporta ambiente su file
pt_br: Exportar ambiente para arquivo
ru_ru: Экспорт окружения в файл
zh_cn: 将环境输出到文件

# ExportEnvironment/IncludeVariablesSecrets
source: Include secret variables
it_it: Includi variabili segrete
pt_br: Incluir variáveis secretas
ru_ru: Включать секретные переменные
zh_cn: 包含秘密变量

# ExportEnvironment/PororocaEnvironmentFormat
source: Pororoca environment
it_it: Ambiente Pororoca
pt_br: Ambiente Pororoca
ru_ru: Pororoca окружение
zh_cn: Pororoca 环境

# ExportEnvironment/PostmanEnvironmentFormat
source: Postman environment
it_it: Ambiente Postman
pt_br: Ambiente Postman
ru_ru: Postman окружение
zh_cn: Postman 环境

# Folder/NewFolder
source: New folder
it_it: Nuova cartella
pt_br: Nova pasta
ru_ru: Новая папка
zh_cn: 新建文件夹

# SelectFolderDialog/Title
source: Select destination folder
it_it: Seleziona la cartella di destinazione
pt_br: Selecione a pasta de destino
ru_ru: Выберите папку назначения
zh_cn: 选择目标文件夹

# HelpDialog/Title
source: Help
it_it: Aiuto
pt_br: Ajuda
ru_ru: Ажуда
zh_cn: 帮助

# HelpDialog/Content
source: Keyboard shortcuts\\n\\nF1 - Show help\\nF2 - Rename\\nF4 - Focus on URL\\nF5 - Send request / connect WebSocket\\nF6 - Cancel request / disconnect WebSocket\\nF7 - Set previous environment as active\\nF8 - Set next environment as active\\nF9 - Save response body to file\\nF10 - Export HTTP log to file\\nCtrl+PageUp - Switch to item above in tree\\nCtrl+PageDown - Switch to item below in tree\\nCtrl+Shift+S - Save all\\n\\nFull documentation on site: https://pororoca.io
it_it: Scorciatoie da tastiera\\n\\nF1 - Mostra aiuto\\nF2 - Rinomina\\nF4 - Focus sull'URL\\nF5 - Invia richiesta / connetti WebSocket\\nF6 - Annulla richiesta / disconnetti WebSocket\\nF7 - Imposta l'ambiente precedente come attivo\\nF8 - Imposta il prossimo ambiente come attivo\\nF9 - Salva il corpo della risposta su file\\nF10 - Esporta HTTP log su file\\nCtrl+PagSu - Passa all'elemento sopra nell'albero\\nCtrl+PagGiù - Passa all'elemento sotto nell'albero\\nCtrl+Shift+S - Salva tutto\\n\\nDocumentazione completa sul sito: https://pororoca.io
pt_br: Atalhos do teclado\\n\\nF1 - Mostrar a ajuda\\nF2 - Renomear\\nF4 - Focar na URL\\nF5 - Enviar requisição / conectar WebSocket\\nF6 - Cancelar requisição / desconectar WebSocket\\nF7 - Ativar ambiente anterior\\nF8 - Ativar próximo ambiente\\nF9 - Salvar corpo da resposta a arquivo\\nF10 - Exportar log HTTP a arquivo\\nCtrl+PageUp - Alternar para item acima na árvore\\nCtrl+PageDown - Alternar para item abaixo na árvore\\nCtrl+Shift+S - Salvar tudo\\n\\nDocumentação completa em: https://pororoca.io
ru_ru: Горячие клавиши\\n\\nF1 - Показать справку\\nF2 - Переименовать\\nF4 - Сосредоточиться на URL-адресе\\nF5 - Отправить запрос / подключить WebSocket\\nF6 - Отменить запрос / отключить WebSocket\\nF7 - Установить предыдущую среду как активную\\nF8 - Установить следующую среду как активную\\nF9 - Сохранить тело ответа в файл\\nF10 - Экспорт журнала HTTP в файл\\nCtrl+PageUp - Переключиться на элемент выше в дереве\\nCtrl+PageDown - Переключитесь на элемент ниже в дереве\\nCtrl+Shift+S - Сохранить все\\n\\nПолная документация на сайте: https://pororoca.io
zh_cn: 键盘快捷方式\\n\\nF1 - 显示帮助\\nF2 - 重命名\\nF4 - 关注 URL\\nF5 - 发送请求/连接 WebSocket\\nF6 - 取消请求/断开 WebSocket\\nF7 - 将上一个环境设置为活动\\nF8 - 将下一个环境设置为活动\\nF9 - 将响应正文保存到文件\\nF10 - 将 HTTP 日志输出到文件\\nCtrl+PageUp -切换到树中上方的项\\nCtrl+PageDown -切换到树中的下方的项\\nCtrl+Shift+S -保存所有\\n\\n网站上的完整文档：https://pororoca.io

# HttpRepeater/NewRepeater
source: New HTTP repeater
it_it: Nuovo ripetitore
pt_br: Nova repetidora HTTP
ru_ru: Новый ретранслятор
zh_cn: 新建 HTTP 转发器

# HttpRepeater/SelectBaseRequest
source: (select the base http request)
it_it: (Selezionare la richiesta HTTP di base)
pt_br: (selecione a requisição http de base)
ru_ru: (Выберите базовый HTTP-запрос)
zh_cn: (选择基本http请求)

# HttpRepeater/RefreshBaseRequestsListTip
source: Refresh list
it_it: Aggiorna l'elenco
pt_br: Atualizar lista
ru_ru: Обновить список
zh_cn: 刷新列表

# HttpRepeater/Start
source: Start
it_it: Cominciare
pt_br: Iniciar
ru_ru: Начало
zh_cn: 开始

# HttpRepeater/StartTip
source: Start (F5)
it_it: Cominciare (F5)
pt_br: Iniciar (F5)
ru_ru: Начало (F5)
zh_cn: 开始 (F5)

# HttpRepeater/Stop
source: Stop
it_it: Fermarsi
pt_br: Parar
ru_ru: Остановка
zh_cn: 停止

# HttpRepeater/StopTip
source: Stop (F6)
it_it: Fermarsi (F6)
pt_br: Parar (F6)
ru_ru: Остановка (F6)
zh_cn: 停止 (F6)

# HttpRepeater/RepetitionSectionTitle
source: Repetition
it_it: Ripetizione
pt_br: Repetição
ru_ru: Повторение
zh_cn: 重复

# HttpRepeater/RepetitionMode
source: Mode
it_it: Modo
pt_br: Modo
ru_ru: Режим
zh_cn: 模式

# HttpRepeater/RepetitionModeSimple
source: Simple
it_it: Semplice
pt_br: Simples
ru_ru: Простой
zh_cn: 简单

# HttpRepeater/RepetitionModeSequential
source: Sequential
it_it: Sequenziale
pt_br: Seqüencial
ru_ru: Последовательный
zh_cn: 顺序

# HttpRepeater/RepetitionModeRandom
source: Random
it_it: Aleatorio
pt_br: Aleatório
ru_ru: Случайный
zh_cn: 随机

# HttpRepeater/NumberOfRepetitions
source: Quantity
it_it: Quantità
pt_br: Quantidade
ru_ru: Количество
zh_cn: 数量

# HttpRepeater/MaxDOP
source: Parallelism
it_it: Parallelismo
pt_br: Paralelismo
ru_ru: Параллелизм
zh_cn: 并行度

# HttpRepeater/Delay
source: Delay (ms)
it_it: Ritardo (ms)
pt_br: Espera (ms)
ru_ru: Задержка (мс)
zh_cn: 延迟 (ms)

# HttpRepeater/DelayTip
source: Waiting time between a response and sending the next request.
it_it: Tempo di attesa tra una risposta e l'invio della richiesta successiva.
pt_br: Tempo de espera entre uma resposta e o envio da próxima requisição.
ru_ru: Время ожидания между ответом и отправкой следующего запроса.
zh_cn: 响应和发送下一个请求之间的等待时间。

# HttpRepeater/InputData
source: Input data
it_it: Dati di input
pt_br: Dados de entrada
ru_ru: Входные данные
zh_cn: 输入数据

# HttpRepeater/InputDataTypeRaw
source: Raw JSON array
it_it: JSON array in testo
pt_br: Array JSON em texto
zh_cn: 原始JSON数组

# HttpRepeater/InputDataTypeRawComment
source: comments are allowed
it_it: commenti sono consentiti
pt_br: comentários são permitidos
ru_ru: Комментарии разрешены
zh_cn: 允许添加注释

# HttpRepeater/InputDataTypeFile
source: File
pt_br: Arquivo
ru_ru: Файл
zh_cn: 文件

# HttpRepeater/InputDataFileSrcPathWatermark
source: (file src path)
it_it: (percorso del file)
pt_br: (caminho do arquivo)
ru_ru: (путь к файлу)
zh_cn: (文件来源路径)

# HttpRepeater/InputDataFileSearch
source: Search file…
it_it: Cerca file…
pt_br: Procurar arquivo…
ru_ru: Найти файл…
zh_cn: 搜索文件...

# HttpRepeater/ExportReport
source: Export report…
it_it: Genera report…
pt_br: Gerar relatório…
ru_ru: Создание отчета…
zh_cn: 导出报告…

# HttpRepeater/SaveAllResponses
source: Save all responses…
it_it: Salva le risposte…
pt_br: Salvar respostas…
ru_ru: Сохранение ответов…
zh_cn: 保存所有响应…
