Repository: alexandrehtrb/Pororoca
Catalog: src/Pororoca.Desktop/Localization/strings.*.resx
Languages: it_it, pt_br, ru_ru, zh_cn

# HttpRepeater/ExportAllLogs
source: Export all logs…
it_it: Esporta logs…
pt_br: Exportar logs…
ru_ru: Экспорт журналов…
zh_cn: 导出所有日志...

# HttpRepeater/InputLine
source: Input line
it_it: Linea di input
pt_br: Linha de entrada
ru_ru: Входная строка
zh_cn: 输入线

# HttpRepeater/InputLineKey
source: VARIABLE NAME
it_it: NOME VARIABILE
pt_br: NOME DA VARIÁVEL
ru_ru: ИМЯ ПЕРЕМЕННОЙ

# HttpRepeater/InputLineValue
source: VALUE
it_it: VALORE
pt_br: VALOR
ru_ru: ЗНАЧЕНИЕ

# HttpRepeater/RepetitionOngoingStatus
source: {0}/{1} repetitions, {2} successful. Estimated time remaining: {3}.
it_it: {0}/{1} ripetizioni, {2} riuscite. Tempo rimanente stimato: {3}.
pt_br: {0} de {1} repetições, {2} com sucesso. Tempo restante estimado: {3}.
ru_ru: {0}/{1} повторения, {2} успешных. Приблизительное оставшееся время: {3}.
zh_cn: 重复 {0}/{1} 次，成功 {2} 次。 预计剩余时间：{3}。

# HttpRepeater/RepetitionFinishedStatus
source: Finished {0} repetitions, {1} successful. Elapsed time: {2}.
it_it: Hai completato {0} ripetizioni, {1} riuscite. Tempo trascorso: {2}.
pt_br: Finalizadas {0} repetições, {1} com sucesso. Tempo decorrido: {2}.
ru_ru: Выполнено {0} повторений, {1} успешных. Затраченное время: {2}.
zh_cn: 完成 {0} 次重复, {1} 次成功。运行时间：{2}。

# HttpRepeater/RepetitionSuccessTip
source: Successful: HTTP 2xx status code.
it_it: Riuscita: codice di stato HTTP 2xx.
pt_br: Com sucesso: status code HTTP 2xx.
ru_ru: Успешно: код состояния HTTP 2xx.
zh_cn: 成功：HTTP 2xx 状态代码。

# HttpRepeater/RepetitionResultCancelled
source: cancelled
it_it: annullato
pt_br: cancelada
ru_ru: Отменен
zh_cn: 取消

# HttpRepeater/RepetitionResultException
source: exception
it_it: eccezione
pt_br: exceção
ru_ru: исключение
zh_cn: 意外

# HttpRepeater/Results
source: Results
it_it: Risultati
pt_br: Resultados
ru_ru: Результаты
zh_cn: 结果

# HttpRequest/Body
source: Body
it_it: Corpo
pt_br: Corpo
zh_cn: 主体

# HttpRequest/BodyFileContentTypeWatermark
source: (file content-type)
it_it: (content-type del file)
pt_br: (content-type do arquivo)
ru_ru: (файл content-type)
zh_cn: (文件内容类型)

# HttpRequest/BodyFileSearchFile
source: Search file…
it_it: Cerca file…
pt_br: Procurar arquivo…
ru_ru: Найти файл…
zh_cn: 搜索文件...

# HttpRequest/BodyFileSrcPathWatermark
source: (file path)
it_it: (percorso del file)
pt_br: (caminho do arquivo)
ru_ru: (путь к файлу)
zh_cn: (文件路径)

# HttpRequest/BodyFormDataFileParamAdd
source: Add file
it_it: Aggiungi file
pt_br: Adicionar arquivo
ru_ru: Добавить файл
zh_cn: 添加文件

# HttpRequest/BodyFormDataParamEnabled
source: ENABLED
it_it: ABILITATO
pt_br: HABILITADO
ru_ru: ВКЛЮЧЕН

# HttpRequest/BodyFormDataParamName
source: NAME
it_it: NOME
pt_br: NOME
ru_ru: ИМЯ

# HttpRequest/BodyFormDataParamRemove
source: Remove
it_it: Rimuovi
pt_br: Remover
ru_ru: Удалить
zh_cn: 移除

# HttpRequest/BodyFormDataParamTextOrSrcPath
source: TEXT / PATH
it_it: TESTO / PERCORSO
pt_br: TEXTO / CAMINHO

# HttpRequest/BodyFormDataParamType
source: TYPE
it_it: TIPO
pt_br: TIPO
ru_ru: ТИП

# HttpRequest/BodyFormDataParamTypeFile
source: File
pt_br: Arquivo
ru_ru: Файл
zh_cn: 文件

# HttpRequest/BodyFormDataParamTypeText
source: Text
it_it: Testo
pt_br: Texto
ru_ru: Текст
zh_cn: 文本

# HttpRequest/BodyFormDataTextParamAdd
source: Add text
it_it: Aggiungi testo
pt_br: Adicionar texto
ru_ru: Добавить текст
zh_cn: 添加文本

# HttpRequest/BodyGraphQlQueryWatermark
source: (graph ql query here)
it_it: (qui la query di graphql)
pt_br: (query graph ql aqui)
ru_ru: (graph ql запрос)
zh_cn: (graph ql 查询)

# HttpRequest/BodyGraphQlVariablesWatermark
source: (graph ql variables here)
it_it: (qui le variabili di graphql)
pt_br: (variáveis graph ql aqui)
ru_ru: (graph ql переменные)
zh_cn: (graph ql 变量)

# HttpRequest/BodyModeFile
source: File
pt_br: Arquivo
ru_ru: Файл
zh_cn: 文件

# HttpRequest/BodyModeNone
source: None
it_it: Nessuno
pt_br: Nenhum
ru_ru: Отсутствует
zh_cn: 无

# HttpRequest/BodyModeRaw
source: Raw
it_it: Testo
pt_br: Texto
zh_cn: 原始

# HttpRequest/BodyRawContentTypeWatermark
source: (raw content-type here)
it_it: (qui il tipo di contenuto in formato testo)
pt_br: (content-type do corpo aqui)
zh_cn: (原始内容类型)

# HttpRequest/BodyRawContentWatermark
source: (raw body here)
it_it: (qui il corpo in formato testo)
pt_br: (corpo da requisição aqui)
zh_cn: (原始主体)

# HttpRequest/BodyUrlEncodedParamAdd
source: Add param
it_it: Aggiungi parametro
pt_br: Adicionar parâmetro
ru_ru: Добавить параметр
zh_cn: 添加参数

# HttpRequest/BodyUrlEncodedParamEnabled
source: ENABLED
it_it: ABILITATO
pt_br: HABILITADO
ru_ru: ВКЛЮЧЕН

# HttpRequest/BodyUrlEncodedParamName
source: PARAMETER NAME
it_it: NOME PARAMETRO
pt_br: NOME DO PARÂMETRO
ru_ru: ИМЯ ПАРАМЕТРА

# HttpRequest/BodyUrlEncodedParamRemove
source: Remove
it_it: Rimuovi
pt_br: Remover
ru_ru: Удалить
zh_cn: 移除

# HttpRequest/BodyUrlEncodedParamValue
source: VALUE
it_it: VALORE
pt_br: VALOR
ru_ru: ЗНАЧЕНИЕ

# HttpRequest/CancelRequest
source: Cancel
it_it: Annulla
pt_br: Cancelar
ru_ru: Отмена
zh_cn: 取消

# HttpRequest/CancelRequestToolTip
source: Cancel (F6)
it_it: Annulla (F6)
pt_br: Cancelar (F6)
ru_ru: Отмена (F6)
zh_cn: 取消 (F6)

# HttpRequest/CustomAuth
source: Custom Auth
it_it: Autenticazione
pt_br: Autenticação
ru_ru: Auth
zh_cn: 自定义授权

# HttpRequest/HeaderAdd
source: Add header
it_it: Aggiungi intestazione
pt_br: Adicionar cabeçalho
ru_ru: Добавить header
zh_cn: 添加报头

# HttpRequest/HeaderEnabled
source: ENABLED
it_it: ABILITATO
pt_br: HABILITADO
ru_ru: ВКЛЮЧЕН

# HttpRequest/HeaderName
source: HEADER NAME
it_it: NOME INTESTAZIONE
pt_br: NOME DO CABEÇALHO
ru_ru: HEADER ИМЯ

# HttpRequest/HeaderRemove
source: Remove
it_it: Rimuovi
pt_br: Remover
ru_ru: Удалить
zh_cn: 移除

# HttpRequest/HeaderValue
source: VALUE
it_it: VALORE
pt_br: VALOR
ru_ru: ЗНАЧЕНИЕ

# HttpRequest/Headers
source: Headers
it_it: Intestazioni
pt_br: Cabeçalhos
zh_cn: 报头

# HttpRequest/NewRequest
source: New HTTP request
it_it: Nuova richiesta HTTP
pt_br: Nova requisição HTTP
ru_ru: Новый HTTP запрос
zh_cn: 新建 HTTP 请求

# HttpRequest/SectionTitle
source: Request
it_it: Richiesta
pt_br: Requisição
ru_ru: Запрос
zh_cn: 请求

# HttpRequest/SendRequest
source: Send
it_it: Invia
pt_br: Enviar
ru_ru: Отправить
zh_cn: 发送

# HttpRequest/SendRequestToolTip
source: Send (F5)
it_it: Invia (F5)
pt_br: Enviar (F5)
ru_ru: Отправить (F5)
zh_cn: 发送 (F5)

# HttpRequest/UrlWatermark
source: (request url here)
it_it: (qui l'url della richiesta)
pt_br: (url da requisição aqui)
ru_ru: (запрос url)
zh_cn: (请求 url)

# HttpResponse/Body
source: Body
it_it: Corpo
pt_br: Corpo
zh_cn: 主体

# HttpResponse/BodyContentBinaryNotShown
source: (binary content not shown, {0} bytes)
it_it: (contenuto binario non mostrato, {0} byte)
pt_br: (conteúdo binário não-exibido, {0} bytes)
ru_ru: (двоичное содержимое не отображается, {0} байтов)
zh_cn: (未显示二进制内容，{0} 字节)

# HttpResponse/BodyContentTypeWatermark
source: (response content-type here)
it_it: (qui il tipo di contenuto della risposta)
pt_br: (content-type da resposta aqui)
ru_ru: (ответ content-type)
zh_cn: (响应内容类型)

# HttpResponse/BodyContentWatermark
source: (response body here)
it_it: (qui il corpo della risposta)
pt_br: (corpo da resposta aqui)
ru_ru: (ответ body)
zh_cn: (响应主体)

# HttpResponse/BodyCouldNotReadAsUTF8
source: (could not read body as UTF-8 text, {0} bytes)
it_it: (impossibile leggere il corpo come testo UTF-8, {0} byte)
pt_br: (não foi possível ler o corpo como texto UTF-8, {0} bytes)
ru_ru: (не удалось прочитать тело как UTF-8 текст, {0} байтов)
zh_cn: (无法将正文读取为 UTF-8 文本，{0} 字节)

# HttpResponse/BodySaveToFile
source: Save as…
it_it: Salva come…
pt_br: Salvar como…
ru_ru: Сохранить как…
zh_cn: 另存为...

# HttpResponse/BodySaveToFileToolTip
source: Save as… (F9)
it_it: Salva come… (F9)
pt_br: Salvar como… (F9)
ru_ru: Сохранить как… (F9)
zh_cn: 另存为... (F9)

# HttpResponse/ExportLog
source: Export log…
it_it: Esporta log…
pt_br: Exportar log…
ru_ru: Журнал экспорта…
zh_cn: 导出日志...

# HttpResponse/ExportLogToolTip
source: Export log… (F10)
it_it: Esporta log… (F10)
pt_br: Exportar log… (F10)
ru_ru: Журнал экспорта… (F10)
zh_cn: 导出日志... (F10)

# HttpResponse/DisableTlsVerification
source: Disable TLS verification
it_it: Disabilita la verifica TLS
pt_br: Desabilitar verificação de TLS
ru_ru: Отключить TLS проверку
zh_cn: 关闭 TLS 验证

# HttpResponse/HeaderName
source: HEADER NAME
it_it: NOME INTESTAZIONE
pt_br: NOME DO CABEÇALHO
ru_ru: HEADER ИМЯ

# HttpResponse/HeaderValue
source: VALUE
it_it: VALORE
pt_br: VALOR
ru_ru: ЗНАЧЕНИЕ

# HttpResponse/Headers
source: Headers
it_it: Intestazioni
pt_br: Cabeçalhos
zh_cn: 报头

# HttpResponse/SectionTitle
source: Response
it_it: Risposta
pt_br: Resposta
ru_ru: Ответ
zh_cn: 响应

# HttpResponse/SectionTitleFailedFormat
source: Response: Failed ({0})
it_it: Risposta: Fallita ({0})
pt_br: Resposta: Falhou ({0})
ru_ru: Ответ: Неудачный ({0})
zh_cn: 响应：失败 ({0})

# HttpResponse/SectionTitleSuccessfulFormat
source: Response: {0} ({1})
it_it: Risposta: {0} ({1})
pt_br: Resposta: {0} ({1})
ru_ru: Ответ: {0} ({1})
zh_cn: 响应：{0} ({1})

# HttpResponse/Capture
source: Capture
it_it: Cattura
pt_br: Captura
ru_ru: Захват
zh_cn: 捕获

# HttpResponse/CaptureAddHeaderCapture
source: Add header capture
it_it: Cattura intestazione
pt_br: Capturar cabeçalho
ru_ru: Захват header
zh_cn: 添加标头捕获

# HttpResponse/CaptureAddBodyCapture
source: Add body capture
it_it: Cattura corpo
pt_br: Capturar corpo
ru_ru: Захват body
zh_cn: 添加主题捕捉

# HttpResponse/CaptureTargetVariable
source: TARGET VARIABLE
it_it: VARIABILE DI DESTINAZIONE
pt_br: VARIÁVEL-ALVO
ru_ru: ЦЕЛЕВАЯ ПЕРЕМЕННАЯ

# HttpResponse/CaptureType
source: TYPE
it_it: TIPO
pt_br: TIPO
ru_ru: ТИП

# HttpResponse/CaptureTypeHeader
source: Header
it_it: intestazione
pt_br: Cabeçalho
zh_cn: 报头

# HttpResponse/CaptureTypeBody
source: Body
it_it: corpo
pt_br: Corpo
zh_cn: 主体

# HttpResponse/CaptureHeaderNameOrBodyPath
source: HEADER NAME / BODY PATH
it_it: NOME INTESTAZIONE / PERCORSO CORPO
pt_br: CABEÇALHO / CAMINHO NO CORPO

# HttpResponse/CaptureCapturedValue
source: VALUE
it_it: VALORE
pt_br: VALOR
ru_ru: ЗНАЧЕНИЕ

# HttpResponse/ExecuteCapturesTooltip
source: Execute captures
it_it: Eseguire acquisizioni
pt_br: Executar capturas
ru_ru: Выполнение захватов
zh_cn: 执行捕获

# HttpResponse/CaptureTip
source: Tip: For JSON value capture: $.myProp[0].myProp2 ($ means root, [0] means array element). For XML value capture, use XPath 1.0 syntax.\\n\\nCaptured values are saved into current environment variables. If no environment is active, then into collection variables.
it_it: Suggerimento: Per l'acquisizione del valore JSON: $.myProp[0].myProp2 ($ significa radice, [0] significa elemento dell'array). Per l'acquisizione del valore XML, utilizzare la sintassi XPath 1.0.\\n\\nI valori acquisiti vengono salvati nelle variabili di ambiente correnti. Se non è attivo alcun ambiente, verranno nelle variabili di collezione.
pt_br: Dica: Para captura de valor JSON: $.myProp[0].myProp2 ($ significa raíz, [0] significa elemento de lista). Para captura de valor XML, use a sintaxe XPath 1.0.\\n\\nOs valores capturados são salvos como variáveis do ambiente atual. Se não houver um ambiente ativo, então serão salvos em variáveis da coleção.
ru_ru: Совет: Для захвата значений JSON: $.myProp[0].myProp2 ($ означает корень, [0] означает array element). Для захвата значений XML используйте синтаксис XPath 1.0.\\n\\nПерехваченные значения сохраняются в текущих переменных среды. Если ни одна среда не активна, то они будут сохранены в переменных коллекции.
zh_cn: 提示：对于JSON值捕获：$.myProp[0].myProp2 ($表示根，[0]表示数组元素)。对于 XML 值捕获，请使用 XPath 1.0 语法。\\n\\n捕获的值保存到当前环境变量中。如果没有活动的环境，则进入集合变量。

# RequestAuth/AuthModeInheritFromCollection
source: Inherit from collection
it_it: Eredita dalla raccolta
pt_br: Herdar da coleção
ru_ru: Наследовать из коллекции
zh_cn: 继承集合

# RequestAuth/AuthModeBasicPasswordWatermark
source: (basic auth password)
pt_br: (basic auth senha)
ru_ru: (basic auth пароль)
zh_cn: (基本授权密码)

# RequestAuth/AuthModeClientCertificate
source: Client certificate
it_it: Certificato del client
pt_br: Certificado de cliente
ru_ru: Клиентский сертификат
zh_cn: 客户端证书

# RequestAuth/AuthModeNone
source: None
it_it: Nessuno
pt_br: Nenhuma
ru_ru: Отсутствует
zh_cn: 无

# RequestAuth/AuthModeWindowsUseCurrentUser
source: Use current user
it_it: Usa utente corrente
pt_br: Usar usuário atual
ru_ru: Использовать текущего пользователя
zh_cn: 使用当前用户

# RequestAuth/AuthModeWindowsDomainWatermark
source: (domain)
it_it: (dominio)
pt_br: (domínio)
zh_cn: (域)

# RequestAuth/CertificateFilePathWatermark
source: (certificate file path here)
it_it: (qui il percorso del file del certificato)
pt_br: (caminho do certificado aqui)
ru_ru: (путь к файлу сертификата)
zh_cn: (证书文件路径)

# RequestAuth/ClientCertificateTypeNone
source: None
it_it: Nessuno
pt_br: Nenhum
ru_ru: Отсутствует
zh_cn: 无

# RequestAuth/FilePasswordWatermark
source: (file password here)
it_it: (qui la password del file)
pt_br: (senha do arquivo aqui)
ru_ru: (пароль к файлу)
zh_cn: (文件密码)

# RequestAuth/PemClientCertificatesTip
source: Tip: If the certificate file contains the private key, leave the private key path blank. The password is required only if the private key is encrypted.
it_it: Suggerimento: Se il file del certificato contiene la chiave privata, lasciare vuoto il percorso della chiave privata. La password è richiesta solo se la chiave privata è criptata.
pt_br: Dica: Se o arquivo do certificado contiver a chave privada, deixe o caminho desta em branco. A senha só é necessária se a chave privada estiver encriptada.
ru_ru: Совет: Если файл сертификата содержит закрытый ключ, оставьте путь к закрытому ключу пустым. Пароль требуется только в том случае, если закрытый ключ зашифрован.
zh_cn: 提示：如果证书文件包含私钥，请将私钥路径留空。只有当私钥加密时才需要密码。

# RequestAuth/PemImportCertificateFileDialogTitle
source: Import certificate in PEM format
it_it: Importa certificato in formato PEM
pt_br: Importar certificado em formato PEM
ru_ru: Импорт сертификата в PEM формат
zh_cn: 导入 PEM 格式的证书

# RequestAuth/PemImportCertificateFileTypesDescription
source: PEM certificates
it_it: Certificati PEM
pt_br: Certificados PEM
ru_ru: PEM сертификаты
zh_cn: PEM 证书

# RequestAuth/PemImportPrivateKeyFileDialogTitle
source: Import private key in PEM format
it_it: Importa chiave privata in formato PEM
pt_br: Importar chave privada em formato PEM
ru_ru: Импорт закрытого ключа в PEM формат
zh_cn: 以 PEM 格式导入私钥

# RequestAuth/PemImportPrivateKeyFileTypesDescription
source: PEM private keys
it_it: Chiavi private PEM
pt_br: Chaves privadas PEM
ru_ru: PEM закрытые ключи
zh_cn: PEM 私钥

# RequestAuth/PemSearchCertFile
source: Search certificate…
it_it: Cerca certificato…
pt_br: Procurar certificado…
ru_ru: Найти серитификат…
zh_cn: 搜索证书...

# RequestAuth/PemSearchPrivateKeyFile
source: Search private key…
it_it: Cerca chiave privata…
pt_br: Procurar chave privada…
ru_ru: Поиск закрытого ключа…
zh_cn: 搜索私钥...

# RequestAuth/Pkcs12ImportCertificateFileDialogTitle
source: Import certificate in PKCS12 format
it_it: Importa certificato in formato PKCS12
pt_br: Importar certificado em formato PKCS12
ru_ru: Импорт сертификата в PKCS12 формат
zh_cn: 导入 PKCS12 格式的证书

# RequestAuth/Pkcs12ImportCertificateFileTypesDescription
source: PKCS12 certificates
it_it: Certificati PKCS12
pt_br: Certificados PKCS12
ru_ru: PKCS12 сертификаты
zh_cn: PKCS12 证书

# RequestAuth/Pkcs12SearchFile
source: Search certificate…
it_it: Cerca certificato…
pt_br: Procurar certificado…
ru_ru: Найти серитификат…
zh_cn: 搜索证书...

# RequestAuth/PrivateKeyFilePathWatermark
source: (private key file path here)
it_it: (qui il percorso del file della chiave privata)
pt_br: (caminho da chave privada aqui)
ru_ru: (путь к файлу закрытого ключа)
zh_cn: (私钥文件路径)

# RequestValidation/WindowsAuthLoginCannotBeBlank
source: The login for Windows authentication cannot be blank.
it_it: Il login per l'autenticazione Windows non può essere vuoto.
pt_br: O login para autenticação Windows não pode ter valor em branco.
ru_ru: Имя входа для проверки подлинности Windows не может быть пустым.
zh_cn: Windows 身份验证的登录名不能为空。

# RequestValidation/WindowsAuthPasswordCannotBeBlank
source: The password for Windows authentication cannot be blank.
it_it: La password per l'autenticazione Windows non può essere vuota.
pt_br: A senha para autenticação Windows não pode ter valor em branco.
ru_ru: Пароль для проверки подлинности Windows не может быть пустым.
zh_cn: Windows 身份验证的密码不能为空。

# RequestValidation/WindowsAuthDomainCannotBeBlank
source: The domain for Windows authentication cannot be blank.
it_it: Il dominio per l'autenticazione Windows non può essere vuoto.
pt_br: O domínio para autenticação Windows não pode ter valor em branco.
ru_ru: Домен для проверки подлинности Windows не может быть пустым.
zh_cn: Windows 身份验证的域不能为空。

# RequestValidation/ClientCertificateFileNotFound
source: Client certificate file not found.
it_it: File del certificato client non trovato.
pt_br: Arquivo de certificado de cliente não encontrado.
ru_ru: Файл сертификата клиента не найден.
zh_cn: 找不到客户端证书文件。

# RequestValidation/ClientCertificatePkcs12PasswordCannotBeBlank
source: PKCS#12 client certificates need a password.
it_it: I certificati client PKCS#12 necessitano di una password.
pt_br: Certificado de cliente PKCS#12 precisa de senha.
ru_ru: PKCS#12 для клиентских сертификатов требуется пароль.
zh_cn: PKCS#12 客户端证书需要密码。

# RequestValidation/ClientCertificatePemPrivateKeyFileNotFound
source: Client certificate private key file not found.
it_it: File della chiave privata del certificato client non trovato.
pt_br: Arquivo de chave privada de certificado de cliente não encontrado.
ru_ru: Файл закрытого ключа клиентского сертификата не найден.
zh_cn: 找不到客户端证书私钥文件。

# RequestValidation/ContentTypeCannotBeBlankReqBodyRawOrFile
source: The request body requires a Content-Type.
it_it: Il corpo della richiesta richiede un Content-Type.
pt_br: O corpo de requisição requer um Content-Type.
ru_ru: В теле запроса требуется Content-Type.
zh_cn: 请求主体需要内容类型。

# RequestValidation/Http2Unavailable
source: On Windows, support for HTTP/2 requires Windows 10 or greater.
it_it: Su Windows, il supporto per HTTP/2 richiede Windows 10 o superiore.
pt_br: No Windows, suporte ao HTTP/2 requer Windows 10 ou superior.
ru_ru: В Windows для поддержки HTTP/2 требуется Windows 10 или более поздней версии.
zh_cn: 在 Windows 上，对 HTTP/2 的支持需要 Windows 10 或更高版本。

# RequestValidation/Http3Unavailable
source: HTTP/3 is only available for Linux with msquic or Windows 11 and greater.
it_it: HTTP/3 è disponibile solo per Linux con msquic o Windows 11 e versioni successive.
pt_br: HTTP/3 só está disponível para Linux com msquic ou Windows 11 e superior.
ru_ru: HTTP/3 доступен только для Linux с msquic или Windows 11 и более поздних версий.
zh_cn: HTTP/3 仅适用于配备 msquic 的 Linux 或 Windows 11 及更高版本。

# RequestValidation/InvalidContentTypeFormData
source: One of the Form Data parameters has an invalid Content-Type.
it_it: Uno dei parametri Form Data ha un Content-Type non valido.
pt_br: Um dos parâmetros Form Data tem Content-Type inválido.
ru_ru: Один из параметров Form Data имеют недопустимое значение Content-Type.
zh_cn: 表单数据参数之一的内容类型无效。

# RequestValidation/InvalidContentTypeRawOrFile
source: Use one of the available Content-Types for the request body.
it_it: Usare uno dei tipi di contenuto disponibili per il corpo della richiesta.
pt_br: Use um dos Content-Types disponíveis para o corpo da requisição.
ru_ru: Используйте один из доступных Content-Types для тела запроса.
zh_cn: 为请求正文使用一种可用的内容类型。

# RequestValidation/InvalidUnknownCause
source: The request is invalid. Please, check it and try again.
it_it: La richiesta non è valida, controllala e riprova.
pt_br: A requisição é inválida. Por favor, verifique-a e tente novamente.
ru_ru: Запрос недействителен. Пожалуйста, проверьте это и повторите попытку.
zh_cn: 请求无效。请检查并再试一次。

# RequestValidation/InvalidUrl
source: Invalid URL. Please, check it and try again.
it_it: URL non valido. Controllalo e riprova.
pt_br: URL inválida. Por favor, verifique-a e tente novamente.
ru_ru: Неверный URL. Пожалуйста, проверьте и попробуйте снова.
zh_cn: 无效的 URL。请检查并再试一次。

# RequestValidation/RepetitionBaseHttpRequestNotSelected
source: Select the base HTTP request to repeat.
it_it: Selezionare la richiesta HTTP di base da ripetere.
pt_br: Selecione a requisição HTTP para repetição.
ru_ru: Выберите базовый HTTP-запрос для повторения.
zh_cn: 选择要重复的基本 HTTP 请求。

# RequestValidation/RepetitionBaseHttpRequestNotFound
source: Base HTTP request not found.
it_it: Richiesta HTTP di base non trovata.
pt_br: Requisição HTTP de base não encontrada.
ru_ru: Базовый HTTP-запрос не найден.
zh_cn: 找不到基本 HTTP 请求。

# RequestValidation/RepetitionDelayCantBeNegative
source: The delay has to be greater or equal to zero.
it_it: Il ritardo deve essere maggiore o uguale a zero.
pt_br: O tempo de espera precisa ser maior ou igual a zero.
ru_ru: Задержка должна быть больше или равна нулю.
zh_cn: 延迟必须大于或等于零。

# RequestValidation/RepetitionNumberOfRepetitionsMustBeAtLeast1
source: The number of repetitions needs to be greater or equal to one.
it_it: Il numero di ripetizione deve essere maggiore o uguale a uno.
pt_br: O número de repetições precisa ser maior ou igual a um.
ru_ru: Количество повторений должно быть больше или равно одному.
zh_cn: 重复次数需要大于或等于 1。

# RequestValidation/RepetitionMaxDopMustBeAtLeast1
source: The parallelism needs to be greater or equal to one.
it_it: Il parallelismo deve essere maggiore o uguale a uno.
pt_br: O paralelismo precisa ser maior ou igual a um.
ru_ru: Параллелизм должен быть больше или равен единице.
zh_cn: 并行度需要大于或等于 1。

# RequestValidation/RepetitionInputDataFileNotFound
source: Input data file not found.
it_it: File di dati di input non trovato.
pt_br: Arquivo de entrada não encontrado.
ru_ru: Файл входных данных не найден.
zh_cn: 找不到输入数据文件。

# RequestValidation/RepetitionInputDataInvalid
source: Invalid input data JSON array.
it_it: JSON array di dati di input non valida.
pt_br: Array JSON de entrada inválido.
ru_ru: Недопустимый массив входных данных JSON.
zh_cn: 输入数据 JSON 数组无效。

# RequestValidation/RepetitionInputDataAtLeastOneLine
source: At least one input line is required.
it_it: È necessaria almeno una linea di input.
pt_br: Pelo menos uma linha de entrada é necessária.
ru_ru: Требуется хотя бы одна строка ввода.
zh_cn: 至少需要一条输入行。

# RequestValidation/ReqBodyFileNotFound
source: File for request body not found.
it_it: Impossibile trovare il corpo del file per la richiesta.
pt_br: Arquivo para o corpo de requisição não encontrado.
ru_ru: Файл для запроса body не найден.
zh_cn: 找不到请求正文的文件。

# RequestValidation/WebSocketClientMessageContentFileNotFound
source: The file that composes the message was not found.
it_it: Impossibile trovare il file che compone il messaggio.
pt_br: O arquivo que forma a mensagem não foi encontrado.
ru_ru: Файл, из которого состоит сообщение, не был найден.
zh_cn: 未找到组成该消息的文件。

# RequestValidation/WebSocketCompressionMaxWindowBitsOutOfRange
source: The compression max window bits must be within 9 and 15.
it_it: I bit massimi della finestra di compressione devono essere compresi tra 9 e 15.
pt_br: O máximo de bits das janelas de compressão deve estar entre 9 e 15.
ru_ru: Биты окна максимального сжатия должны находиться в пределах 9 и 15.
zh_cn: 压缩最大窗口位必须在9到15之间。

# RequestValidation/WebSocketHttpVersionUnavailable
source: This HTTP version is not available for WebSocket connections.
it_it: Questa versione HTTP non è disponibile per le connessioni WebSocket.
pt_br: Esta versão de HTTP não está disponível para conexão WebSocket.
ru_ru: Эта версия HTTP недоступна для подключений через WebSocket.
zh_cn: 此 HTTP 版本不可用于 WebSocket 连接。

# RequestValidation/WebSocketNotConnected
source: Not connected.
it_it: Non connesso.
pt_br: Não está conectado.
ru_ru: Нет соединения.
zh_cn: 未连接。
